Core/src/Documents/ДоговорКредитаИЗайма/ДоговорКредитаИЗайма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорКредитаИЗайма</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ГрафикПогашенияКредитовИЗаймов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоКредитамИЗаймам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКредитаИЗайма</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавкаГодовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогашатьИзЗаработнойПлаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПогашения</name>
    <type>
      <types>EnumRef.ВариантыПогашенияЗаймаСотрудником</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПроцентов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКомиссии</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомиссии</name>
    <type>
      <types>EnumRef.ТипыКомиссииКредитовИЗаймов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежей</name>
    <type>
      <types>EnumRef.ВидыПлатежейПогашенияКредитаИЗайма</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдержаниеОсновнойДолг</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>УдержаниеПроценты</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ВГоду360Дней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПроцентовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКомиссииРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРаспределенияДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислитьПроценты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикПлатежейИНачислений</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОсновногоДолга</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПроцентов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРег</name>
    <comment>Сумма в регламентированной валюте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ВидыДоговоровКредитаИЗайма/ВидыДоговоровКредитаИЗайма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКредитаИЗайма</name>
  <enumValues>
    <name>ДоговорЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>КредитПолученный</name>
  </enumValues>
  <enumValues>
    <name>КредитВыданный</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийЗаказПокупателя/ВидыОперацийЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийЗаказПокупателя</name>
  <enumValues>
    <name>ЗаказНаПродажу</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаПереработку</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаряд</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыКомиссииКредитовИЗаймов/ТипыКомиссииКредитовИЗаймов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКомиссииКредитовИЗаймов</name>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтСуммыКредита</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОтОстаткаСуммыКредита</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйГрафик</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийРасходнаяНакладная/ВидыОперацийРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходнаяНакладная</name>
  <enumValues>
    <name>ПродажаПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПереработки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПродажаСотруднику</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ДоговорКредитаИЗайма/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Перем ИспользоватьТолькоРегламентированныйПланСчетов Экспорт;
#Область ОбработчикиСобытыий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем СтратегияЗаполнения;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		
		Сотрудник = ДанныеЗаполнения;
		ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("ДокументСсылка.РасходнаяНакладная")] = "ЗаполнитьПоРасходнойНакладной";
		
	//--------------------------------------------------------------------------
	// © Шишка В.В. [4 декабря 2023]  НАЧАЛО
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя")
			И ДанныеЗаполнения.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаказПокупателя.ЗаказНаряд")
			Тогда
		
		СтратегияЗаполнения = Новый Соответствие;
		СтратегияЗаполнения[Тип("ДокументСсылка.ЗаказПокупателя")] = "ЗаполнитьПоЗаказуНаряду";
		
	// © Шишка В.В. [4 декабря 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Сотрудник") И 
			ЗначениеЗаполнено(ДанныеЗаполнения.Сотрудник) Тогда
			
			Сотрудник = ДанныеЗаполнения;
			Контрагент = Справочники.Контрагенты.ПустаяСсылка();
			ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику;
			
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Контрагент") И
			ЗначениеЗаполнено(ДанныеЗаполнения.Контрагент) Тогда
			
			Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
			Контрагент = ДанныеЗаполнения.Контрагент;
			ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.КредитПолученный;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику Тогда
		Контрагент = Неопределено;
	Иначе
		Сотрудник = Неопределено;
		ПогашатьИзЗаработнойПлаты = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроведения.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	Документы.ДоговорКредитаИЗайма.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей.
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыСПокупателями(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьГрафикПогашенияКредитовИЗаймов(ДополнительныеСвойства, Движения, Отказ);
	УправлениеНебольшойФирмойСервер.ОтразитьРасчетыПоКредитамИЗаймам(ДополнительныеСвойства, Движения, Отказ);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ОтразитьХозрасчетный(ДополнительныеСвойства, Движения, Отказ);
	
	// Запись наборов записей.
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ДоговорКредитаИЗайма.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКредитаИЗайма.ДоговорЗаймаСотруднику Тогда
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");
		Если ПроцентнаяСтавкаГодовая = 0 Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентов");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентовРегл");//+++
		КонецЕсли;
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссии");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссииРегл");//+++
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ТипКомиссии");
		
	Иначе
		
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Сотрудник");
		Если ПроцентнаяСтавкаГодовая = 0 Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентов");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентовРегл");//+++
		КонецЕсли;
		Если ТипКомиссии = Перечисления.ТипыКомиссииКредитовИЗаймов.Нет Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссии");
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссииРегл");//+++
		КонецЕсли;
		
	КонецЕсли;
	
	//+++ Дмг
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		
		Если СчетУчетаРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаКомиссииРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаПроцентовРегл.ТипСчета <> Перечисления.ТипыСчетов.Расходы 
			Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиница");
		КонецЕсли;
		
	Иначе
	//--- Дмгг
		Если СчетУчета.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаКомиссии.ТипСчета <> Перечисления.ТипыСчетов.Расходы И
			СчетУчетаПроцентов.ТипСчета <> Перечисления.ТипыСчетов.Расходы 
			Тогда
			УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СтруктурнаяЕдиница");
		КонецЕсли;
	КонецЕсли; //+++ Дмгг
	
	//+++ Дмгг
	Если ИспользоватьТолькоРегламентированныйПланСчетов Тогда 
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчета");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаПроцентов");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетУчетаКомиссии");
		УправлениеНебольшойФирмойСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "СчетЗатрат");    
	КонецЕсли;
	//--- Дмгг
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаУдаленияПроведения объекта.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	// Контроль возникновения отрицательного остатка.
	Документы.ДоговорКредитаИЗайма.ВыполнитьКонтроль(Ссылка, ДополнительныеСвойства, Отказ);
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.РасходнаяНакладная - Данные заполнения документа.
//	
Процедура ЗаполнитьПоРасходнойНакладной(ДокументОснование) Экспорт
	
	Если ДокументОснование.ВидОперации <> Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
		ТекстИсключения = НСтр("ka='დოკუმენტის შეყვანა ოპერაციის საფუძველზე შეუძლებელია - ""%ВидОперации""!';ru='Невозможен ввод документа на основании операции - ""%ВидОперации""!';en='You can not enter a document on the basis of the operation - ""% VidOperatsii""!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ВидОперации", ДокументОснование.ВидОперации);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный) КАК ВидДоговора,
	|	&Ссылка КАК ДокументОснование,
	|	ДокументРасходнаяНакладная.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(&Ссылка) КАК Основание,
	|	ДокументРасходнаяНакладная.Контрагент КАК Контрагент,
	|	ДокументРасходнаяНакладная.ВалютаДокумента КАК ВалютаРасчетов,
	|	&Ссылка КАК ДокументРеализации,
	|	&Дата КАК ДатаПредоставления
	|ИЗ
	|	Документ.РасходнаяНакладная КАК ДокументРасходнаяНакладная
	|ГДЕ
	|	ДокументРасходнаяНакладная.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	ЗаполнитьСуммуОстаткомЗадолженности();
	
КонецПроцедуры

//--------------------------------------------------------------------------
// © Шишка В.В. [4 декабря 2023]  НАЧАЛО
// Процедура заполнения документа на основании.
//
// Параметры:
//	ДокументОснование - ДокументСсылка.ЗаказПокупателя - Данные заполнения документа.
//	
Процедура ЗаполнитьПоЗаказуНаряду(ДокументОснование) Экспорт
	
	Если ДокументОснование.ВидОперации <> Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
		ТекстИсключения = НСтр("ka='დოკუმენტის შეყვანა ოპერაციის საფუძველზე შეუძლებელია - ""%ВидОперации""!';ru='Невозможен ввод документа на основании операции - ""%ВидОперации""!';en='You can not enter a document on the basis of the operation - ""%ВидОперации""!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%ВидОперации", ДокументОснование.ВидОперации);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	Если ДокументОснование.СостояниеЗаказа <> Справочники.СостоянияЗаказНарядов.Завершен Тогда
		ТекстИсключения = НСтр("ka='დოკუმენტის შეყვანა ოპერაციის საფუძველზე შეუძლებელია - ""%Состояние""!';ru='Невозможен ввод документа в состоянии - ""%Состояние""!';en='You can not enter a document on the basis of the status - ""%Состояние""!'");
		ТекстИсключения = СтрЗаменить(ТекстИсключения, "%Состояние", ДокументОснование.СостояниеЗаказа);
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
//ДокументОснование.СостояниеЗаказа	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный) КАК ВидДоговора,
	|	&Ссылка КАК ДокументОснование,
	|	ДокументЗаказНаряд.Организация КАК Организация,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(&Ссылка) КАК Основание,
	|	ДокументЗаказНаряд.Контрагент КАК Контрагент,
	|	ДокументЗаказНаряд.ВалютаДокумента КАК ВалютаРасчетов,
	|	&Ссылка КАК ДокументРеализации,
	|	&Дата КАК ДатаПредоставления
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ДокументЗаказНаряд
	|ГДЕ
	|	ДокументЗаказНаряд.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
	ЗаполнитьСуммуОстаткомЗадолженности();
	
КонецПроцедуры
	
// © Шишка В.В. [4 декабря 2023]  КОНЕЦ
//--------------------------------------------------------------------------

Процедура ЗаполнитьСуммуОстаткомЗадолженности()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0)) КАК СуммаЗадолженности
	|ИЗ
	|	РегистрНакопления.РасчетыСПокупателями.Остатки(
	|			&Дата,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И &УсловиеПоДоговору
	|				И &УсловиеПоДокументу) КАК РасчетыСПокупателямиОстатки";
	
	ПараметрыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДокументРеализации,
		"Договор, Контрагент.ВестиРасчетыПоДоговорам, Контрагент.ВестиРасчетыПоДокументам");
	
	Если ПараметрыСделки.КонтрагентВестиРасчетыПоДоговорам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоговору", "Договор = &Договор");
		Запрос.УстановитьПараметр("Договор", ПараметрыСделки.Договор);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДоговору", "ИСТИНА");
	КонецЕсли;
	
	Если ПараметрыСделки.КонтрагентВестиРасчетыПоДокументам Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДокументу", "Документ = &Документ");
		Запрос.УстановитьПараметр("Документ", ДокументРеализации);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДокументу", "ИСТИНА");
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СуммаДокумента = Выборка.СуммаЗадолженности;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

ИспользоватьТолькоРегламентированныйПланСчетов = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата())); //+++ Дмгг
#КонецЕсли
